# <center><u>Project 2 - Part 2 (Core)</u>
* Authored by: Eric N Valdez

* Date: 1/18/2024

<center><img src = "1218 Data/imdb.png">

### Connect to your MySQL database with pandas and sqlalchemy.

In [1]:
#Imports
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [2]:
import json
with open('/Users/Valde/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

### Run the SHOW TABLES; query to show the list of tables.

In [3]:
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/imdb"
engine = create_engine(connection)

In [4]:
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_imdb
0         genres
1        ratings
2   title_basics
3   title_genres

### For each table, run a DESCRIBE table command to display the column details (including data type).

#### title_basics

In [5]:
title_basics_url = "1218 Data/title-basics.csv"
title_basics = pd.read_csv(title_basics_url)
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [6]:
q = '''DESCRIBE title_basics;'''
pd.read_sql(q, engine)

           Field           Type Null  Key Default Extra
0         tconst            int   NO  PRI    None
1  primary_title    varchar(55)  YES         None
2     start_year       datetime  YES         None
3        runtime  decimal(10,2)  YES         None

#### title_ratings

In [7]:
ratings_url = "1218 Data/title-ratings.csv"
ratings = pd.read_csv(ratings_url)
ratings.head()

      tconst  averageRating  numVotes
0  tt0035423            6.4     87153
1  tt0062336            6.4       175
2  tt0069049            6.7      7754
3  tt0088751            5.2       336
4  tt0096056            5.6       846

In [8]:
q = '''DESCRIBE ratings;'''
pd.read_sql(q, engine)

             Field         Type Null  Key Default Extra
0           tconst          int   NO  PRI    None
1   average_rating  varchar(55)  YES         None
2  number_of_votes          int  YES         None

### Prepare the title_basics and ratings DataFrames for the database.
    * Use "df.to_sql" to append the data to the correct tables

In [10]:
title_basics.to_sql('title_basics', engine, index=False, if_exists = 'replace')

87008

In [11]:
ratings.to_sql('ratings', engine, index=False, if_exists = 'replace')

71941

## Confirm the Database has been updated correctly

In [12]:
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_imdb
0         genres
1        ratings
2   title_basics
3   title_genres

## <u>For each of the 4 tables</u>
* ### Run a "DESCRIBE table" command to confirm the data types have not changed.

In [13]:
q = '''DESCRIBE genres;'''
pd.read_sql(q, engine)

        Field         Type Null  Key Default Extra
0    genre_id          int   NO  PRI    None
1  genre_name  varchar(55)  YES         None

In [14]:
q = '''DESCRIBE ratings;'''
pd.read_sql(q, engine)

           Field    Type Null Key Default Extra
0         tconst    text  YES        None
1  averageRating  double  YES        None
2       numVotes  bigint  YES        None

In [15]:
q = '''DESCRIBE title_basics;'''
pd.read_sql(q, engine)

            Field    Type Null Key Default Extra
0          tconst    text  YES        None
1       titleType    text  YES        None
2    primaryTitle    text  YES        None
3   originalTitle    text  YES        None
4         isAdult  bigint  YES        None
5       startYear  double  YES        None
6         endYear  double  YES        None
7  runtimeMinutes  bigint  YES        None
8          genres    text  YES        None

In [16]:
q = '''DESCRIBE title_genres;'''
pd.read_sql(q, engine)

      Field Type Null  Key Default Extra
0  genre_id  int   NO  PRI    None
1    tconst  int   NO  PRI    None

* ### Run a "SELECT * FROM table LIMIT 5" query to preview the first 5 rows from each table.

In [21]:
q= '''SELECT * FROM genres LIMIT 5'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [genre_id, genre_name]
Index: []

In [22]:
q = '''SELECT * FROM ratings LIMIT 5'''
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0035423            6.4     87153
1  tt0062336            6.4       175
2  tt0069049            6.7      7754
3  tt0088751            5.2       336
4  tt0096056            5.6       846

In [23]:
q = '''SELECT * FROM title_basics LIMIT 5'''
pd.read_sql(q, engine)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,None,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,None,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,None,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,None,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,None,126,Drama

In [24]:
q ='''SELECT * FROM title_genres LIMIT 5'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [genre_id, tconst]
Index: []